Tekla Open API Reference for Tekla Structures 2025
LevelMark.SubType Property
 Gets or sets the subtype of the level mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LevelMark.LevelMarkType SubType { get; set; }
Public Property SubType As LevelMark.LevelMarkType
	Get
	Set
Property Value
Type: LevelMark.LevelMarkType
See Also
Reference
LevelMark Class
Tekla.Structures.Drawing Namespace